app/Controllers/Customer/Dashboard.php

    public function index()
    {
        // 1. Security check
        if (session()->get('role') !== 'customer') {
            return redirect()->to('/login');
        }

        // 2. Fetch products and shippable locations
        $productModel = new ProductModel();
        $shippingModel = new \App\Models\ShippingLocationModel();

        // 3. Prepare data for the view
        $data =[
            'title'             => 'Customer Portal',
            'username'          => session()->get('username'),
            'products'          => $productModel->findAll(),
            'shippingLocations' => $shippingModel->where('is_active', 1)->findAll()
---
SELECT *
FROM `products`
SELECT *
FROM `shipping_locations`
WHERE `is_active` = 1

    public function validateLocation()
    {
        $barangay = trim($this->request->getPost('barangay'));
        if (empty($barangay)) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'No location detected']);
        }

        $shippingModel = new \App\Models\ShippingLocationModel();

        // Simple search - MySQL is case-insensitive by default for VARCHAR
        $location = $shippingModel->where('barangay_name', $barangay)
                                 ->where('is_active', 1)
                                 ->first();
---
SELECT *
FROM `shipping_locations`
WHERE LOWER(barangay_name) = 'tungkil'
AND `is_active` = 1
 LIMIT 1