app/Controllers/Admin/Dashboard.php

    public function index()
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/login');
        }

        $userModel = new UserModel();

        $data = [
            'title'    => 'Admin Dashboard',
            'username' => session()->get('username'),
            // 'users'    => $userModel->findAll(), // Keep it simple for Inertia test
        ];
---
SELECT *
FROM `users`