app/Controllers/Admin/DeliveriesController.php

SELECT *
FROM `deliveries`
ORDER BY `created_at` DESC
SELECT *
FROM `orders`
ORDER BY `created_at` DESC
---
    public function index()
    {
        if (! $this->hasTable()) {
            return view('admin/deliveries_view', [
                'deliveries' => [],
                'orders'     => [],
                'error'      => 'Deliveries table is missing. Run: php spark migrate',
            ]);
        }

        $model = new DeliveryModel();
        $orders = new \App\Models\OrderModel();
        $q = trim((string) $this->request->getGet('q'));
        $status = trim((string) $this->request->getGet('status'));
        $builder = $model->orderBy('created_at', 'DESC');
        if ($q !== '') {
            $builder = $builder->like('rider_name', $q);
        }
        if ($status !== '') {
            $builder = $builder->where('status', $status);
        }
        return view('admin/deliveries_view', [
            'deliveries' => $builder->paginate(10),
            'pager'      => $model->pager,
            'filters'    => compact('q', 'status'),
            'orders'     => $orders->orderBy('created_at', 'DESC')->findAll(),
        ]);