app/Controllers/Admin/PosController.php

SELECT *
FROM `products`
---
    public function getProducts()
    {
        $model = new ProductModel();
        return $this->response->setJSON($model->findAll());