app/Controllers/Admin/ShippingController.php

    public function index()
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/login');
        }

        $model = new ShippingLocationModel();
        $settingsModel = new SettingsModel();

        $data = [
            'title'             => 'Shipping Locations',
            'username'          => session()->get('username'),
            'locations'         => $model->findAll(),
            'ship_to_all'       => $settingsModel->getSetting('ship_to_all', '0')
        ];
---
SELECT *
FROM `shipping_locations`