app/Controllers/Auth.php


            // 4. Connect to database
            $userModel = new UserModel();
            $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'laurmj4@gmail.com'
 LIMIT 1