app/Models/OrderModel.php

SELECT `o`.*, COUNT(oi.id) as item_count
FROM `orders` `o`
LEFT JOIN `order_items` `oi` ON `oi`.`order_id` = `o`.`id`
GROUP BY `o`.`id`
ORDER BY `o`.`created_at` DESC
---
    public function getOrdersWithItemCount()
    {
        return $this->db->table('orders o')
            ->select('o.*, COUNT(oi.id) as item_count')
            ->join('order_items oi', 'oi.order_id = o.id', 'left')
            ->groupBy('o.id')
            ->orderBy('o.created_at', 'DESC')
            ->get()
            ->getResultArray();

SELECT SUM(`total_amount`) AS `total_amount`
FROM `orders`
WHERE `status` = 'Completed'
AND DATE(created_at) = '2026-04-21'
 LIMIT 1
---
    public function getTodayRevenue()
    {
        $result = $this->selectSum('total_amount')
            ->where('status', self::STATUS_COMPLETED)
            ->where('DATE(created_at)', date('Y-m-d'))
            ->first();

SELECT SUM(`total_amount`) AS `total_amount`
FROM `orders`
WHERE `status` = 'Completed'
AND DATE(created_at) = '2026-04-15'
 LIMIT 1
---
    public function getDailyRevenue(string $date): float
    {
        $result = $this->selectSum('total_amount')
            ->where('status', self::STATUS_COMPLETED)
            ->where('DATE(created_at)', $date)
            ->first();