app/Models/ProductModel.php

    public function getDailyInventory()
    {
        $products = $this->findAll();
---
SELECT *
FROM `products`